artillery/simple-test-scenario.yml
config:
  target: "http://localhost:8080/market"
  phases:
    - duration: 1
      arrivalRate: 1
      name: Warm up
  payload:
    # Load search keywords from an external CSV file and make them available
    # to virtual user scenarios as variable "keywords":
    path: "./loadData.csv"
    fields:
      - "clientId"
      - "symbol"
      - "price"
      - "quantity"
      - "side"
  defaults:
    headers:
      Accept: "application/json"
scenarios:
  # We define one scenario:
  - name: "Search and buy"
    flow:
      - post:
          url: "/placeorder"
          json:
            clientId: "{{ clientId }}"
            symbol: "{{ symbol }}"
            price: "{{ price }}"
            quantity: "{{ quantity }}"
            side: "{{ side }}"