artillery/test-load-scenario.yml
config:
  target: "http://localhost:8080/market"
  phases:
      # Create 5 virtual users every second for 5 minutes = 60*5*5=1500 users by the end of the phase
    - duration: 300
      arrivalRate: 5
      name: Warm up
      # Ramp up arrival rate from 10 to 50 over 2 minutes, followed by 10 minutes at 50 arrivals per second.
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load
  payload:
    # Load search keywords from an external CSV file and make them available
    # to virtual user scenarios as variable "keywords":
    path: "./loadData.csv"
    fields:
      - "clientId"
      - "symbol"
      - "price"
      - "quantity"
      - "side"
  defaults:
    headers:
      Accept: "application/json"
scenarios:
  # We define one scenario:
  - name: "Search and buy"
    flow:
      - post:
          url: "/placeorder"
          json:
            clientId: "{{ clientId }}"
            symbol: "{{ symbol }}"
            price: "{{ price }}"
            quantity: "{{ quantity }}"
            side: "{{ side }}"